
  # Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]


backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f_MambaOut_DSA, [128]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f_MambaOut_DSA, [256]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, C2f_MambaOut_DSA, [384]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_MambaOut_DSA, [384]]



head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.3
  - [-1, 1, AIFI, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 13 input_proj.2
  - [[-2, -1], 1, Concat, [1]] # 14
  - [-1, 3, MHE, [128, False, 2, 3]]  # 15, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 16, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 18 input_proj.1
  - [[-2, -1], 1, Concat, [1]]  # 19 cat backbone P3
  - [-1, 3, MHE, [128, False, 2, 3]]    # X3 (20), fpn_blocks.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 22 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 23 cat backbone P2
  - [-1, 3, MHE, [128, False, 2, 3]]    # X3 (24), fpn_blocks.2

  - [-1, 1, Conv, [256, 3, 2]]   # 25, downsample_convs.0
  - [[-1, 20], 1, Concat, [1]]  # 26 cat Y3
  - [-1, 3, MHE, [128, False, 2, 3]]    # F4 (27), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]   # 28, downsample_convs.1
  - [[-1, 16], 1, Concat, [1]]  # 29 cat Y4
  - [-1, 3, MHE, [128, False, 2, 3]]    # F5 (30), pan_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]   # 31, downsample_convs.1
  - [[-1, 11], 1, Concat, [1]]  # 32 cat Y5
  - [-1, 3, MHE, [128, False, 2, 3]]   # F5 (33), pan_blocks.1

  - [[24, 27, 30, 33], 1, RTDETR_position_Decoder, [nc, 128, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
